BacNguyen0801/stm32_rtos/src/drivers/stm32f1x_rcc_driver.c
#include "stm32f1x_rcc_driver.h"
#include "stm32f1x_flash_driver.h"
/* PLL3RDY: PLL3 clock ready flag
Set by hardware to indicate that the PLL3 is locked.
0: PLL3 unlocked
1: PLL3 locked */
#define PLL3RDY_UNLOCKED 0x00
#define PLL3RDY_LOCKED 0x01

/* PLL3ON: PLL3 enable
Set and cleared by software to enable PLL3.
Cleared by hardware when entering Stop or Standby mode.
0: PLL3 OFF
1: PLL3 ON */
#define PLL3ON_OFF 0x00
#define PLL3ON_ON 0x01

/* PLL2RDY: PLL2 clock ready flag
Set by hardware to indicate that the PLL2 is locked.
0: PLL2 unlocked
1: PLL2 locked */
#define PLL2RDY_UNLOCKED 0x00
#define PLL2RDY_LOCKED 0x01

/* PLL2ON: PLL2 enable
Set and cleared by software to enable PLL2.
Cleared by hardware when entering Stop or Standby mode.
0: PLL2 OFF
1: PLL2 ON */
#define PLL2ON_OFF 0x00
#define PLL2ON_ON 0x01

/* PLLRDY: PLL clock ready flag
Set by hardware to indicate that the PLL is locked.
0: PLL unlocked
1: PLL locked */
#define PLLRDY_UNLOCKED 0x00
#define PLLRDY_LOCKED 0x01

/* PLLON: PLL enable
Set and cleared by software to enable PLL2.
Cleared by hardware when entering Stop or Standby mode.
0: PLL OFF
1: PLL ON */
#define PLLON_OFF 0x00
#define PLLON_ON 0x01

/* CSSON: Clock security system enable
Set and cleared by software to enable the clock security system. When CSSON is set, the
clock detector is enabled by hardware when the HSE oscillator is ready, and disabled by
hardware if a HSE clock failure is detected.
0: Clock detector OFF
1: Clock detector ON (Clock detector ON if the HSE oscillator is ready, OFF if not) */
#define CSSON_CLOCK_DETECTOR_OFF 0x00
#define CSSON_CLOCK_DETECTOR_ON 0x01

/* HSEBYP: External high-speed clock bypass
Set and cleared by software to bypass the oscillator with an external clock. The external
clock must be enabled with the HSEON bit set, to be used by the device. The HSEBYP bit
can be written only if the HSE oscillator is disabled.
0: external 3-25 MHz oscillator not bypassed
1: external 3-25 MHz oscillator bypassed with external clock */
#define HSEBYP_EXTERNAL_OSC_NOT_BYPASSED 0x00
#define HSEBYP_EXTERNAL_OSC_BYPASSED 0x01

/* HSERDY: External high-speed clock ready flag
Set by hardware to indicate that the HSE oscillator is stable. This bit needs 6 cycles of the
HSE oscillator clock to fall down after HSEON reset.
0: HSE oscillator not ready
1: HSE oscillator ready */
#define HSERDY_HSE_NOT_READY 0x00
#define HSERDY_HSE_READY 0x01

/* HSEON: HSE clock enable
Set and cleared by software.
Cleared by hardware to stop the HSE oscillator when entering Stop or Standby mode. This
bit cannot be reset if the HSE oscillator is used directly or indirectly as the system clock.
0: HSE oscillator OFF
1: HSE oscillator ON */
#define HSEON_OSC_OFF 0x00
#define HSEON_OSC_ON 0x01

/* HSICAL[7:0]: Internal high-speed clock calibration
These bits are initialized automatically at startup. */
#define HSICAL_DEFAULT_VALUE 0x00

/* HSITRIM[4:0]: Internal high-speed clock trimming
These bits provide an additional user-programmable trimming value that is added to the
HSICAL[7:0] bits. It can be programmed to adjust to variations in voltage and temperature
that influence the frequency of the internal HSI RC.
The default value is 16, which, when added to the HSICAL value, should trim the HSI to 8
MHz ± 1%. The trimming step (Fhsitrim) is around 40 kHz between two consecutive HSICAL
step */
#define HSITRIM_DEFAULT_VALUE 0x00

/* HSIRDY: Internal high-speed clock ready flag
Set by hardware to indicate that internal 8 MHz RC oscillator is stable. After the HSION bit
is cleared, HSIRDY goes low after 6 internal 8 MHz RC oscillator clock cycles.
0: Internal 8 MHz RC oscillator not ready
1: Internal 8 MHz RC oscillator ready */
#define HSIRDY_8MHz_OSC_NOT_READY 0x00
#define HSIRDY_8MHz_OSC_READY 0x01

/* HSION: Internal high-speed clock enable
Set and cleared by software.
Set by hardware to force the internal 8 MHz RC oscillator ON when leaving Stop or Standby
mode or in case of failure of the external 3-25 MHz oscillator used directly or indirectly as
system clock. This bit can not be cleared if the internal 8 MHz RC is used directly or
indirectly as system clock or is selected to become the system clock.
0: Internal 8 MHz RC oscillator OFF
1: Internal 8 MHz RC oscillator ON */
#define HSION_8Mhz_INTERNAL_OFF 0x00
#define HSION_8Mhz_INTERNAL_ON 0x01

/* MCO: Microcontroller clock output
Set and cleared by software.
0xx: No clock
100: System clock (SYSCLK) selected
101: HSI clock selected
110: HSE clock selected
111: PLL clock divided by 2 selected */
#define MCO_NO_CLOCK_OUTPUT 0x00
#define MCO_SYSCLK_CLOCK_OUTPUT 0x04
#define MCO_HSI_CLOCK_OUTPUT 0x05
#define MCO_HSE_CLOCK_OUTPUT 0x06
#define MCO_PLL_DIV2_CLOCK_OUTPUT 0x07

/* USBPRE: USB prescaler
Set and cleared by software to generate 48 MHz USB clock. This bit must be valid before
enabling the USB clock in the RCC_APB1ENR register. This bit can’t be reset if the USB
clock is enabled.
0: PLL clock is divided by 1.5
1: PLL clock is not divided */
#define USBPRE_PLL_DIV 0x00
#define USBPRE_PLL_NOT_DIV 0x01

/* PLLMUL: PLL multiplication factor
These bits are written by software to define the PLL multiplication factor. These bits can be
written only when PLL is disabled.
Caution: The PLL output frequency must not exceed 72 MHz.
0000: PLL input clock x 2
0001: PLL input clock x 3
0010: PLL input clock x 4
0011: PLL input clock x 5
0100: PLL input clock x 6
0101: PLL input clock x 7
0110: PLL input clock x 8
0111: PLL input clock x 9
1000: PLL input clock x 10
1001: PLL input clock x 11
1010: PLL input clock x 12
1011: PLL input clock x 13
1100: PLL input clock x 14
1101: PLL input clock x 15
1110: PLL input clock x 16
1111: PLL input clock x 16 */
#define PLLMUL_MUL_2 0x00
#define PLLMUL_MUL_3 0x01
#define PLLMUL_MUL_4 0x02
#define PLLMUL_MUL_5 0x03
#define PLLMUL_MUL_6 0x04
#define PLLMUL_MUL_7 0x05
#define PLLMUL_MUL_8 0x06
#define PLLMUL_MUL_9 0x07
#define PLLMUL_MUL_10 0x08
#define PLLMUL_MUL_11 0x09
#define PLLMUL_MUL_12 0x0A
#define PLLMUL_MUL_13 0x0B
#define PLLMUL_MUL_14 0x0C
#define PLLMUL_MUL_15 0x0D
#define PLLMUL_MUL_16 0x0E

/* PLLXTPRE: HSE divider for PLL entry
Set and cleared by software to divide HSE before PLL entry. This bit can be written only
when PLL is disabled.
0: HSE clock not divided
1: HSE clock divided by 2 */
#define PLLXTPRE_NOT_DIV 0x00
#define PLLXTPRE_DIV_2 0x01

/* PLLSRC: PLL entry clock source
Set and cleared by software to select PLL clock source. This bit can be written only when PLL is
disabled.
0: HSI oscillator clock / 2 selected as PLL input clock
1: Clock from PREDIV1 selected as PLL input clock */
#define PLLSRC_HSI_CLOCK_DIV_2 0x00
#define PLLSRC_HSE_CLOCK 0x01

/* ADCPRE[1:0]: ADC prescaler
Set and cleared by software to select the frequency of the clock to the ADCs.
00: PCLK2 divided by 2
01: PCLK2 divided by 4
10: PCLK2 divided by 6
11: PCLK2 divided by 8 */
#define ADCPRE_PCLK_DIV_2 0x00
#define ADCPRE_PCLK_DIV_4 0x01
#define ADCPRE_PCLK_DIV_6 0x02
#define ADCPRE_PCLK_DIV_8 0x03

/* PPRE2[2:0]: APB high-speed prescaler (APB2)
Set and cleared by software to control the division factor of the APB High speed clock (PCLK2).
0xx: HCLK not divided
100: HCLK divided by 2
101: HCLK divided by 4
110: HCLK divided by 8
111: HCLK divided by 16 */
#define PPRE2_HCLK_NOT_DIV 0x00
#define PPRE2_HCLK_DIV_2 0x04
#define PPRE2_HCLK_DIV_4 0x05
#define PPRE2_HCLK_DIV_8 0x06
#define PPRE2_HCLK_DIV_16 0x07

/* PPRE1[2:0]: APB Low-speed prescaler (APB1)
Set and cleared by software to control the division factor of the APB Low speed clock (PCLK1).
0xx: HCLK not divided
100: HCLK divided by 2
101: HCLK divided by 4
110: HCLK divided by 8
111: HCLK divided by 16 */
#define PPRE1_HCLK_NOT_DIV 0x00
#define PPRE1_HCLK_DIV_2 0x04
#define PPRE1_HCLK_DIV_4 0x05
#define PPRE1_HCLK_DIV_8 0x06
#define PPRE1_HCLK_DIV_16 0x07

/* HPRE[3:0]: AHB prescaler
Set and cleared by software to control AHB clock division factor.
0xxx: SYSCLK not divided
1000: SYSCLK divided by 2
1001: SYSCLK divided by 4
1010: SYSCLK divided by 8
1011: SYSCLK divided by 16
1100: SYSCLK divided by 64
1101: SYSCLK divided by 128
1110: SYSCLK divided by 256
1111: SYSCLK divided by 512 */
#define HPRE_SYSCLK_NOT_DIV 0x00
#define HPRE_SYSCLK_DIV_2 0x08
#define HPRE_SYSCLK_DIV_4 0x09
#define HPRE_SYSCLK_DIV_8 0x0A
#define HPRE_SYSCLK_DIV_16 0x0B
#define HPRE_SYSCLK_DIV_64 0x0C
#define HPRE_SYSCLK_DIV_128 0x0D
#define HPRE_SYSCLK_DIV_256 0x0E
#define HPRE_SYSCLK_DIV_512 0x0F

/* SWS[1:0]: System clock switch status
Set and cleared by hardware to indicate which clock source is used as system clock.
00: HSI oscillator used as system clock
01: HSE oscillator used as system clock
10: PLL used as system clock
11: Not applicable */
#define SWS_HSI_STS_SELECTED 0x00
#define SWS_HSE_STS_SELECTED 0x01
#define SWS_PLL_STS_SELECTED 0x02

/* SW[1:0]: System clock Switch
Set and cleared by software to select SYSCLK source.
Set by hardware to force HSI selection when leaving Stop and Standby mode or in case of failure of
the HSE oscillator used directly or indirectly as system clock (if the Clock Security System is
enabled).
00: HSI selected as system clock
01: HSE selected as system clock
10: PLL selected as system clock
11: Not allowed */
#define SW_HSI_SELECTED 0x00
#define SW_HSE_SELECTED 0x01
#define SW_PLL_SELECTED 0x02

/* CSSC: Clock security system interrupt clear
This bit is set by software to clear the CSSF flag.
0: No effect
1: Clear CSSF flag */
#define CSSC_NO_EFFECT 0x00
#define CSSC_CLEAR_FLAG 0x01

/* PLL3RDYC: PLL3 Ready Interrupt Clear
This bit is set by software to clear the PLL3RDYF flag.
0: No effect
1: Clear PLL3RDYF flag */
#define PLL3RDYC_NO_EFFECT 0x00
#define PLL3RDYC_CLEAR_FLAG 0x01

/* PLL2RDYC: PLL2 Ready Interrupt Clear
This bit is set by software to clear the PLL2RDYF flag.
0: No effect
1: Clear PLL2RDYF flag */
#define PLL2RDYC_NO_EFFECT 0x00
#define PLL2RDYC_CLEAR_FLAG 0x01

