BacNguyen0801/stm32_rtos/src/drivers/stm32f1x_rcc_driver.c
/* PLLRDYC: PLL Ready Interrupt Clear
This bit is set by software to clear the PLLRDYF flag.
0: No effect
1: Clear PLLRDYF flag */
#define PLLRDYC_NO_EFFECT 0x00
#define PLLRDYC_CLEAR_FLAG 0x01

/* HSERDYC: HSE ready interrupt clear
This bit is set by software to clear the HSERDYF flag.
0: No effect
1: Clear HSERDYF flag */
#define HSERDYC_NO_EFFECT 0x00
#define HSERDYC_CLEAR_FLAG 0x01

/* HSIRDYC: HSI ready interrupt clear
This bit is set by software to clear the HSIRDYF flag.
0: No effect
1: Clear HSIRDYF flag */
#define HSIRDYC_NO_EFFECT 0x00
#define HSIRDYC_CLEAR_FLAG 0x01

/* LSERDYC: LSE ready interrupt clear
This bit is set by software to clear the LSERDYF flag.
0: No effect
1: Clear LSERDYF flag */
#define LSERDYC_NO_EFFECT 0x00
#define LSERDYC_CLEAR_FLAG 0x01

/* LSIRDYC: LSI ready interrupt clear
This bit is set by software to clear the LSIRDYF flag.
0: No effect
1: Clear LSIRDYF flag */
#define LSIRDYC_NO_EFFECT 0x00
#define LSIRDYC_CLEAR_FLAG 0x01

/* PLL3RDYIE: PLL3 Ready Interrupt Enable
Set and cleared by software to enable/disable interrupt caused by PLL3 lock.
0: PLL3 lock interrupt disabled
1: PLL3 lock interrupt enabled */
#define PLL3RDYIE_LOCK_IRQ_DISABLE 0x00
#define PLL3RDYIE_LOCK_IRQ_ENABLE 0x01

/* PLL2RDYIE: PLL2 Ready Interrupt Enable
Set and cleared by software to enable/disable interrupt caused by PLL2 lock.
0: PLL2 lock interrupt disabled
1: PLL2 lock interrupt enabled */
#define PLL2RDYIE_LOCK_IRQ_DISABLE 0x00
#define PLL2RDYIE_LOCK_IRQ_ENABLE 0x01

/* PLLRDYIE: PLL ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by PLL lock.
0: PLL lock interrupt disabled
1: PLL lock interrupt enabled */
#define PLLRDYIE_LOCK_IRQ_DISABLE 0x00
#define PLLRDYIE_LOCK_IRQ_ENABLE 0x01

/* HSERDYIE: HSE ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the external 3-25 MHz
oscillator stabilization.
0: HSE ready interrupt disabled
1: HSE ready interrup */
#define HSERDYIE_IRQ_DISABLE 0x00
#define HSERDYIE_IRQ_ENABLE 0x01

/* HSIRDYIE: HSI ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the internal 8 MHz RC
oscillator stabilization.
0: HSI ready interrupt disabled
1: HSI ready interrupt enabled */
#define HSIRDYIE_IRQ_DISABLE 0x00
#define HSIRDYIE_IRQ_ENABLE 0x01

/* LSERDYIE: LSE ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by the external 32 kHz
oscillator stabilization.
0: LSE ready interrupt disabled
1: LSE ready interrupt enabled */
#define LSERDYIE_IRQ_DISABLE 0x00
#define LSERDYIE_IRQ_ENABLE 0x01

/* LSIRDYIE: LSI ready interrupt enable
Set and cleared by software to enable/disable interrupt caused by internal RC 40 kHz
oscillator stabilization.
0: LSI ready interrupt disabled
1: LSI ready interrupt enabled */
#define LSIRDYIE_IRQ_DISABLE 0x00
#define LSIRDYIE_IRQ_ENABLE 0x01

/* CSSF: Clock security system interrupt flag
Set by hardware when a failure is detected in the external 3-25 MHz oscillator. It is cleared
by software setting the CSSC bit.
0: No clock security interrupt caused by HSE clock failure
1: Clock security interrupt caused by HSE clock failure */
#define LSIRDYIE_IRQ_DISABLE 0x00
#define LSIRDYIE_IRQ_ENABLE 0x01

/* PLL3RDYF: PLL3 Ready Interrupt flag
Set by hardware when the PLL3 locks and PLL3RDYIE is set. It is cleared by software
setting the PLL3RDYC bit.
0: No clock ready interrupt caused by PLL3 lock
1: Clock ready interrupt caused by PLL3 lock */
#define PLL3RDYF_CLOCK_NO_READY 0x00
#define PLL3RDYF_CLOCK_READY 0x01

/* PLL2RDYF: PLL2 Ready Interrupt flag
Set by hardware when the PLL2 locks and PLL2RDYDIE is set. It is cleared by software
setting the PLL2RDYC bit.
0: No clock ready interrupt caused by PLL2 lock
1: Clock ready interrupt caused by PLL2 lock */
#define PLL2RDYF_CLOCK_NO_READY 0x00
#define PLL2RDYF_CLOCK_READY 0x01

/* PLLRDYF: PLL ready interrupt flag
Set by hardware when the PLL locks and PLLRDYDIE is set. It is cleared by software
setting the PLLRDYC bit.
0: No clock ready interrupt caused by PLL lock
1: Clock ready interrupt caused by PLL lock */
#define PLLRDYF_CLOCK_NO_READY 0x00
#define PLLRDYF_CLOCK_READY 0x01

/* HSERDYF: HSE ready interrupt flag
Set by hardware when External High Speed clock becomes stable and HSERDYIE is set. It
is cleared by software setting the HSERDYC bit.
0: No clock ready interrupt caused by the external 3-25 MHz oscillator
1: Clock ready interrupt caused by the external 3-25 MHz oscillator */
#define HSERDYF_CLOCK_NO_READY 0x00
#define HSERDYF_CLOCK_READY 0x01

/* HSIRDYF: HSI ready interrupt flag
Set by hardware when the Internal High Speed clock becomes stable and HSIRDYIE is set.
It is cleared by software setting the HSIRDYC bit.
0: No clock ready interrupt caused by the internal 8 MHz RC oscillator
1: Clock ready interrupt caused by the internal 8 MHz RC oscillator */
#define HSIRDYF_CLOCK_NO_READY 0x00
#define HSIRDYF_CLOCK_READY 0x01

/* LSERDYF: LSE ready interrupt flag
Set by hardware when the External Low Speed clock becomes stable and LSERDYIE is set.
It is cleared by software setting the LSERDYC bit.
0: No clock ready interrupt caused by the external 32 kHz oscillator
1: Clock ready interrupt caused by the external 32 kHz oscillator */
#define LSERDYF_CLOCK_NO_READY 0x00
#define LSERDYF_CLOCK_READY 0x01

/*  LSIRDYF: LSI ready interrupt flag
Set by hardware when Internal Low Speed clock becomes stable and LSIRDYIE is set. It is
cleared by software setting the LSIRDYC bit.
0: No clock ready interrupt caused by the internal RC 40 kHz oscillator
1: Clock ready interrupt caused by the internal RC 40 kHz oscillator */
#define LSIRDYF_CLOCK_NO_READY 0x00
#define LSIRDYF_CLOCK_READY 0x01

/* TIM11RST: TIM11 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM11 timer */
#define TIM11RST_NO_RESET 0x00
#define TIM11RST_RESET 0x01

/* TIM10RST: TIM10 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM10 timer */
#define TIM10RST_NO_RESET 0x00
#define TIM10RST_RESET 0x01

/* TIM9RST: TIM9 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM9 timer */
#define TIM9RST_NO_RESET 0x00
#define TIM9RST_RESET 0x01

/* ADC3RST: ADC3 interface reset
Set and cleared by software.
0: No effect
1: Reset ADC3 interface */
#define ADC3RST_NO_RESET 0x00
#define ADC3RST_RESET 0x01

/* USART1RST: USART1 reset
Set and cleared by software.
0: No effect
1: Reset USART1 */
#define USART1RST_NO_RESET 0x00
#define USART1RST_RESET 0x01

