BacNguyen0801/stm32_rtos/src/drivers/stm32f1x_rcc_driver.c
/* TIM8RST: TIM8 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM8 timer */
#define TIM8RST_NO_RESET 0x00
#define TIM8RST_RESET 0x01

/* SPI1RST: SPI1 reset
Set and cleared by software.
0: No effect
1: Reset SPI1 */
#define SPI1RST_NO_RESET 0x00
#define SPI1RST_RESET 0x01

/* TIM1RST: TIM1 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM1 timer */
#define TIM1RST_NO_RESET 0x00
#define TIM1RST_RESET 0x01

/* ADC2RST: ADC 2 interface reset
Set and cleared by software.
0: No effect
1: Reset ADC 2 interface */
#define ADC2RST_NO_RESET 0x00
#define ADC2RST_RESET 0x01

/* ADC1RST: ADC 1 interface reset
Set and cleared by software.
0: No effect
1: Reset ADC 1 interface */
#define ADC1RST_NO_RESET 0x00
#define ADC1RST_RESET 0x01

/* IOPGRST: IO port G reset
Set and cleared by software.
0: No effect
1: Reset IO port G */
#define IOPGRST_NO_RESET 0x00
#define IOPGRST_RESET 0x01

/* IOPFRST: IO port F reset
Set and cleared by software.
0: No effect
1: Reset IO port F */
#define IOPFRST_NO_RESET 0x00
#define IOPFRST_RESET 0x01

/*  IOPERST: IO port E reset
Set and cleared by software.
0: No effect
1: Reset IO port E */
#define IOPERST_NO_RESET 0x00
#define IOPERST_RESET 0x01

/* IOPDRST: IO port D reset
Set and cleared by software.
0: No effect
1: Reset IO port D */
#define IOPDRST_NO_RESET 0x00
#define IOPDRST_RESET 0x01

/* IOPCRST: IO port C reset
Set and cleared by software.
0: No effect
1: Reset IO port C */
#define IOPCRST_NO_RESET 0x00
#define IOPCRST_RESET 0x01

/* IOPBRST: IO port B reset
Set and cleared by software.
0: No effect
1: Reset IO port B */
#define IOPBRST_NO_RESET 0x00
#define IOPBRST_RESET 0x01

/* IOPARST: IO port A reset
Set and cleared by software.
0: No effect
1: Reset IO port A */
#define IOPARST_NO_RESET 0x00
#define IOPARST_RESET 0x01

/* AFIORST: Alternate function IO reset
Set and cleared by software.
0: No effect
1: Reset Alternate Function */
#define AFIORST_NO_RESET 0x00
#define AFIORST_RESET 0x01

/* DACRST: DAC interface reset
Set and cleared by software.
0: No effect
1: Reset DAC interface */
#define DACRST_NO_RESET 0x00
#define DACRST_RESET 0x01

/* PWRRST: Power interface reset
Set and cleared by software.
0: No effect
1: Reset power interface */
#define PWRRST_NO_RESET 0x00
#define PWRRST_RESET 0x01

/* BKPRST: Backup interface reset
Set and cleared by software.
0: No effect
1: Reset backup interface */
#define BKPRST_NO_RESET 0x00
#define BKPRST_RESET 0x01

/* CANRST: CAN reset
Set and cleared by software.
0: No effect
1: Reset CAN */
#define CANRST_NO_RESET 0x00
#define CANRST_RESET 0x01

/* USBRST: USB reset
Set and cleared by software.
0: No effect
1: Reset USB */
#define USBRST_NO_RESET 0x00
#define USBRST_RESET 0x01

/* I2C2RST: I2C2 reset
Set and cleared by software.
0: No effect
1: Reset I2C2 */
#define I2C2RST_NO_RESET 0x00
#define I2C2RST_RESET 0x01

/* I2C1RST: I2C1 reset
Set and cleared by software.
0: No effect
1: Reset I2C1 */
#define I2C1RST_NO_RESET 0x00
#define I2C1RST_RESET 0x01

/* UART5RST: USART5 reset
Set and cleared by software.
0: No effect
1: Reset USART5 */
#define UART5RST_NO_RESET 0x00
#define UART5RST_RESET 0x01

/* UART5RST: USART4 reset
Set and cleared by software.
0: No effect
1: Reset USART4 */
#define UART4RST_NO_RESET 0x00
#define UART4RST_RESET 0x01

/* UART3RST: USART3 reset
Set and cleared by software.
0: No effect
1: Reset USART3 */
#define UART3RST_NO_RESET 0x00
#define UART3RST_RESET 0x01

/* UART2RST: USART2 reset
Set and cleared by software.
0: No effect
1: Reset USART2 */
#define UART2RST_NO_RESET 0x00
#define UART2RST_RESET 0x01

/*  SPI3RST: SPI3 reset
Set and cleared by software.
0: No effect
1: Reset SPI3 */
#define SPI3RST_NO_RESET 0x00
#define SPI3RST_RESET 0x01

/*  SPI2RST: SPI2 reset
Set and cleared by software.
0: No effect
1: Reset SPI2 */
#define SPI2RST_NO_RESET 0x00
#define SPI2RST_RESET 0x01

/* WWDGRST: Window watchdog reset
Set and cleared by software.
0: No effect
1: Reset window watchdog */
#define WWDGRST_NO_RESET 0x00
#define WWDGRST_RESET 0x01

/* TIM14RST: TIM14 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM14 */
#define TIM14RST_NO_RESET 0x00
#define TIM14RST_RESET 0x01

/* TIM13RST: TIM13 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM13 */
#define TIM13RST_NO_RESET 0x00
#define TIM13RST_RESET 0x01

/* TIM12RST: TIM12 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM12 */
#define TIM12RST_NO_RESET 0x00
#define TIM12RST_RESET 0x01

/* TIM7RST: TIM7 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM7 */
#define TIM7RST_NO_RESET 0x00
#define TIM7RST_RESET 0x01

/* TIM6RST: TIM6 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM6 */
#define TIM6RST_NO_RESET 0x00
#define TIM6RST_RESET 0x01

/* TIM5RST: TIM5 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM5 */
#define TIM5RST_NO_RESET 0x00
#define TIM5RST_RESET 0x01

/* TIM4RST: TIM4 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM4 */
#define TIM4RST_NO_RESET 0x00
#define TIM4RST_RESET 0x01

/* TIM3RST: TIM3 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM3 */
#define TIM3RST_NO_RESET 0x00
#define TIM3RST_RESET 0x01

/* TIM2RST: TIM2 timer reset
Set and cleared by software.
0: No effect
1: Reset TIM2 */
#define TIM2RST_NO_RESET 0x00
#define TIM2RST_RESET 0x01

/* SDIOEN: SDIO clock enable
Set and cleared by software.
0: SDIO clock disabled
1: SDIO clock enabled */
#define SDIOEN_CLOCK_DISABLE 0x00
#define SDIOEN_CLOCK_ENABLE 0x01

/* FSMCEN: FSMC clock enable
Set and cleared by software.
0: FSMC clock disabled
1: FSMC clock enabled */
#define FSMCEN_CLOCK_DISABLE 0x00
#define FSMCEN_CLOCK_ENABLE 0x01

/* CRCEN: CRC clock enable
Set and cleared by software.
0: CRC clock disabled
1: CRC clock enabled */
#define CRCEN_CLOCK_DISABLE 0x00
#define CRCEN_CLOCK_ENABLE 0x01

/* FLITFEN: FLITF clock enable
Set and cleared by software to disable/enable FLITF clock during Sleep mode.
0: FLITF clock disabled during Sleep mode
1: FLITF clock enabled during Sleep mode */
#define FLITFEN_CLOCK_DISABLE 0x00
#define FLITFEN_CLOCK_ENABLE 0x01

