BacNguyen0801/stm32_rtos/src/drivers/stm32f1x_rcc_driver.c
/* SRAMEN: SRAM interface clock enable
Set and cleared by software to disable/enable SRAM interface clock during Sleep mode.
0: SRAM interface clock disabled during Sleep mode.
1: SRAM interface clock enabled during Sleep mode */
#define SRAMEN_CLOCK_DISABLE 0x00
#define SRAMEN_CLOCK_ENABLE 0x01

/* DMA2EN: DMA2 clock enable
Set and cleared by software.
0: DMA2 clock disabled
1: DMA2 clock enabled */
#define DMA2EN_CLOCK_DISABLE 0x00
#define DMA2EN_CLOCK_ENABLE 0x01

/* DMA1EN: DMA1 clock enable
Set and cleared by software.
0: DMA1 clock disabled
1: DMA1 clock enabled */
#define DMA1EN_CLOCK_DISABLE 0x00
#define DMA1EN_CLOCK_ENABLE 0x01

/* Bit 21 TIM11EN: TIM11 timer clock enable
Set and cleared by software.
0: TIM11 timer clock disabled
1: TIM11 timer clock enabled */
#define TIM11EN_CLOCK_DISABLE 0x00
#define TIM11EN_CLOCK_ENABLE 0x01

/* Bit 20 TIM10EN: TIM10 timer clock enable
Set and cleared by software.
0: TIM10 timer clock disabled
1: TIM10 timer clock enabled */
#define TIM10EN_CLOCK_DISABLE 0x00
#define TIM10EN_CLOCK_ENABLE 0x01

/* Bit 19 TIM9EN: TIM9 timer clock enable
Set and cleared by software.
0: TIM9 timer clock disabled
1: TIM9 timer clock enabled */
#define TIM9EN_CLOCK_DISABLE 0x00
#define TIM9EN_CLOCK_ENABLE 0x01

/* Bit 15 ADC3EN: ADC3 interface clock enable
Set and cleared by software.
0: ADC3 interface clock disabled
1: ADC3 interface clock enabled */
#define ADC3EN_CLOCK_DISABLE 0x00
#define ADC3EN_CLOCK_ENABLE 0x01

/* Bit 14 USART1EN: USART1 clock enable
Set and cleared by software.
0: USART1 clock disabled
1: USART1 clock enabled */
#define USART1EN_CLOCK_DISABLE 0x00
#define USART1EN_CLOCK_ENABLE 0x01

/* Bit 13 TIM8EN: TIM8 Timer clock enable
Set and cleared by software.
0: TIM8 timer clock disabled
1: TIM8 timer clock enabled */
#define TIM8EN_CLOCK_DISABLE 0x00
#define TIM8EN_CLOCK_ENABLE 0x01

/* Bit 12 SPI1EN: SPI1 clock enable
Set and cleared by software.
0: SPI1 clock disabled
1: SPI1 clock enabled */
#define SPI1EN_CLOCK_DISABLE 0x00
#define SPI1EN_CLOCK_ENABLE 0x01

/* Bit 11 TIM1EN: TIM1 timer clock enable
Set and cleared by software.
0: TIM1 timer clock disabled
1: TIM1 timer clock enabled */
#define TIM1EN_CLOCK_DISABLE 0x00
#define TIM1EN_CLOCK_ENABLE 0x01

/* Bit 10 ADC2EN: ADC 2 interface clock enable
Set and cleared by software.
0: ADC 2 interface clock disabled
1: ADC 2 interface clock enabled */
#define ADC2EN_CLOCK_DISABLE 0x00
#define ADC2EN_CLOCK_ENABLE 0x01

/* Bit 9 ADC1EN: ADC 1 interface clock enable
Set and cleared by software.
0: ADC 1 interface disabled
1: ADC 1 interface clock enabled */
#define ADC1EN_CLOCK_DISABLE 0x00
#define ADC1EN_CLOCK_ENABLE 0x01

/* Bit 8 IOPGEN: IO port G clock enable
Set and cleared by software.
0: IO port G clock disabled
1: IO port G clock enabled */
#define IOPGEN_CLOCK_DISABLE 0x00
#define IOPGEN_CLOCK_ENABLE 0x01

/* Bit 7 IOPFEN: IO port F clock enable
Set and cleared by software.
0: IO port F clock disabled
1: IO port F clock enabled */
#define IOPFEN_CLOCK_DISABLE 0x00
#define IOPFEN_CLOCK_ENABLE 0x01

/* Bit 6 IOPEEN: IO port E clock enable
Set and cleared by software.
0: IO port E clock disabled
1: IO port E clock enabled */
#define IOPEEN_CLOCK_DISABLE 0x00
#define IOPEEN_CLOCK_ENABLE 0x01

/* Bit 5 IOPDEN: IO port D clock enable
Set and cleared by software.
0: IO port D clock disabled
1: IO port D clock enabled */
#define IOPDEN_CLOCK_DISABLE 0x00
#define IOPDEN_CLOCK_ENABLE 0x01

/* Bit 4 IOPCEN: IO port C clock enable
Set and cleared by software.
0: IO port C clock disabled
1: IO port C clock enabled */
#define IOPCEN_CLOCK_DISABLE 0x00
#define IOPCEN_CLOCK_ENABLE 0x01

/* Bit 3 IOPBEN: IO port B clock enable
Set and cleared by software.
0: IO port B clock disabled
1: IO port B clock enabled */
#define IOPBEN_CLOCK_DISABLE 0x00
#define IOPBEN_CLOCK_ENABLE 0x01

/* Bit 2 IOPAEN: IO port A clock enable
Set and cleared by software.
0: IO port A clock disabled
1: IO port A clock enabled */
#define IOPAEN_CLOCK_DISABLE 0x00
#define IOPAEN_CLOCK_ENABLE 0x01

/* AFIOEN: Alternate function IO clock enable
Set and cleared by software.
0: Alternate Function IO clock disabled
1: Alternate Function IO clock enabled */
#define AFIOEN_CLOCK_DISABLE 0x00
#define AFIOEN_CLOCK_ENABLE 0x01

/* Bit 29 DACEN: DAC interface clock enable
Set and cleared by software.
0: DAC interface clock disabled
1: DAC interface clock enable */
#define DACEN_CLOCK_DISABLE 0x00
#define DACEN_CLOCK_ENABLE 0x01

/* Bit 28 PWREN: Power interface clock enable
Set and cleared by software.
0: Power interface clock disabled
1: Power interface clock enable */
#define PWREN_CLOCK_DISABLE 0x00
#define PWREN_CLOCK_ENABLE 0x01

/* Bit 27 BKPEN: Backup interface clock enable
Set and cleared by software.
0: Backup interface clock disabled
1: Backup interface clock enabled */
#define BKPEN_CLOCK_DISABLE 0x00
#define BKPEN_CLOCK_ENABLE 0x01

/* CANEN: CAN clock enable
Set and cleared by software.
0: CAN clock disabled
1: CAN clock enabled */
#define CANEN_CLOCK_DISABLE 0x00
#define CANEN_CLOCK_ENABLE 0x01

/* USBEN: USB clock enable
Set and cleared by software.
0: USB clock disabled
1: USB clock enabled */
#define USBEN_CLOCK_DISABLE 0x00
#define USBEN_CLOCK_ENABLE 0x01

/* Bit 22 I2C2EN: I2C2 clock enable
Set and cleared by software.
0: I2C2 clock disabled
1: I2C2 clock enabled */
#define I2C2EN_CLOCK_DISABLE 0x00
#define I2C2EN_CLOCK_ENABLE 0x01

/* Bit 21 I2C1EN: I2C1 clock enable
Set and cleared by software.
0: I2C1 clock disabled
1: I2C1 clock enabled */
#define I2C1EN_CLOCK_DISABLE 0x00
#define I2C1EN_CLOCK_ENABLE 0x01

/* Bit 20 UART5EN: USART5 clock enable
Set and cleared by software.
0: USART5 clock disabled
1: USART5 clock enabled */
#define UART5EN_CLOCK_DISABLE 0x00
#define UART5EN_CLOCK_ENABLE 0x01

/* Bit 19 UART4EN: USART4 clock enable
Set and cleared by software.
0: USART4 clock disabled
1: USART4 clock enabled */
#define UART4EN_CLOCK_DISABLE 0x00
#define UART4EN_CLOCK_ENABLE 0x01

/* Bit 18 USART3EN: USART3 clock enable
Set and cleared by software.
0: USART3 clock disabled
1: USART3 clock enabled */
#define UART3EN_CLOCK_DISABLE 0x00
#define UART3EN_CLOCK_ENABLE 0x01

/* Bit 17 USART2EN: USART2 clock enable
Set and cleared by software.
0: USART2 clock disabled
1: USART2 clock enabled */
#define UART2EN_CLOCK_DISABLE 0x00
#define UART2EN_CLOCK_ENABLE 0x01

/* Bit 15 SPI3EN: SPI 3 clock enable
Set and cleared by software.
0: SPI 3 clock disabled
1: SPI 3 clock enabled */
#define SPI3EN_CLOCK_DISABLE 0x00
#define SPI3EN_CLOCK_ENABLE 0x01

/* Bit 14 SPI2EN: SPI2 clock enable
Set and cleared by software.
0: SPI2 clock disabled
1: SPI2 clock enabled */
#define SPI2EN_CLOCK_DISABLE 0x00
#define SPI2EN_CLOCK_ENABLE 0x01

/* WWDGEN: Window watchdog clock enable
Set and cleared by software.
0: Window watchdog clock disabled
1: Window watchdog clock enabled */
#define WWDGEN_CLOCK_DISABLE 0x00
#define WWDGEN_CLOCK_ENABLE 0x01

/* TIM14EN: TIM14 timer clock enable
Set and cleared by software.
0: TIM14 clock disabled
1: TIM14 clock enabled */
#define TIM14EN_CLOCK_DISABLE 0x00
#define TIM14EN_CLOCK_ENABLE 0x01

/* Bit 7 TIM13EN: TIM13 timer clock enable
Set and cleared by software.
0: TIM13 clock disabled
1: TIM13 clock enabled */
#define TIM13EN_CLOCK_DISABLE 0x00
#define TIM13EN_CLOCK_ENABLE 0x01

/* Bit 6 TIM12EN: TIM12 timer clock enable
Set and cleared by software.
0: TIM12 clock disabled
1: TIM12 clock enabled */
#define TIM12EN_CLOCK_DISABLE 0x00
#define TIM12EN_CLOCK_ENABLE 0x01

