BacNguyen0801/stm32_rtos/src/drivers/stm32f1x_rcc_driver.c
/* Bit 5 TIM7EN: TIM7 timer clock enable
Set and cleared by software.
0: TIM7 clock disabled
1: TIM7 clock enabled */
#define TIM7EN_CLOCK_DISABLE 0x00
#define TIM7EN_CLOCK_ENABLE 0x01

/* Bit 4 TIM6EN: TIM6 timer clock enable
Set and cleared by software.
0: TIM6 clock disabled
1: TIM6 clock enabled */
#define TIM6EN_CLOCK_DISABLE 0x00
#define TIM6EN_CLOCK_ENABLE 0x01

/* Bit 3 TIM5EN: TIM5 timer clock enable
Set and cleared by software.
0: TIM5 clock disabled
1: TIM5 clock enabled */
#define TIM5EN_CLOCK_DISABLE 0x00
#define TIM5EN_CLOCK_ENABLE 0x01

/* Bit 2 TIM4EN: TIM4 timer clock enable
Set and cleared by software.
0: TIM4 clock disabled
1: TIM4 clock enabled */
#define TIM4EN_CLOCK_DISABLE 0x00
#define TIM4EN_CLOCK_ENABLE 0x01

/* Bit 1 TIM3EN: TIM3 timer clock enable
Set and cleared by software.
0: TIM3 clock disabled
1: TIM3 clock enabled */
#define TIM3EN_CLOCK_DISABLE 0x00
#define TIM3EN_CLOCK_ENABLE 0x01

/* Bit 0 TIM2EN: TIM2 timer clock enable
Set and cleared by software.
0: TIM2 clock disabled
1: TIM2 clock enabled */
#define TIM2EN_CLOCK_DISABLE 0x00
#define TIM2EN_CLOCK_ENABLE 0x01

/* Bit 16 BDRST: Backup domain software reset
Set and cleared by software.
0: Reset not activated
1: Resets the entire Backup domain */
#define BDRST_RESET_NOT_ACTIVE 0x00
#define BDRST_RESET_ENTIRE_BK_DOMAIN 0x01

/* Bit 15 RTCEN: RTC clock enable
Set and cleared by software.
0: RTC clock disabled
1: RTC clock enabled */
#define RTCEN_CLOCK_DISABLE 0x00
#define RTCEN_CLOCK_ENABLE 0x01

/* RTCSEL: RTC clock source selection
Set by software to select the clock source for the RTC. Once the RTC clock source has been
selected, it cannot be changed anymore unless the Backup domain is reset. The BDRST bit
can be used to reset them.
00: No clock
01: LSE oscillator clock used as RTC clock
10: LSI oscillator clock used as RTC clock
11: HSE oscillator clock divided by 128 used as RTC clock */
#define RTCSEL_NO_CLOCK 0x00
#define RTCSEL_LSE_SELECTED 0x01
#define RTCSEL_LSI_SELECTED 0x02
#define RTCSEL_HSE_SELECTED 0x03

/* Bit 2 LSEBYP: External low-speed oscillator bypass
Set and cleared by software to bypass oscillator in debug mode. This bit can be written only
when the external 32 kHz oscillator is disabled.
0: LSE oscillator not bypassed
1: LSE oscillator bypassed */
#define LSEBYP_LSE_NOT_BYPASSED 0x00
#define LSEBYP_LSE_BYPASSED 0x01

/* Bit 1 LSERDY: External low-speed oscillator ready
Set and cleared by hardware to indicate when the external 32 kHz oscillator is stable. After
the LSEON bit is cleared, LSERDY goes low after 6 external low-speed oscillator clock
cycles.
0: External 32 kHz oscillator not ready
1: External 32 kHz oscillator ready */
#define LSERDY_32KHZ_NOT_READY 0x00
#define LSERDY_32KHZ_READY 0x01

/* Bit 0 LSEON: External low-speed oscillator enable
Set and cleared by software.
0: External 32 kHz oscillator OFF
1: External 32 kHz oscillator ON */
#define LSEON_32KHZ_OFF 0x00
#define LSEON_32KHZ_ON 0x01

/* LPWRRSTF: Low-power reset flag
Set by hardware when a Low-power management reset occurs.
Cleared by writing to the RMVF bit.
0: No Low-power management reset occurred
1: Low-power management reset occurred */
#define LPWRRSTF_RESET_NO_OCCURRED 0x00
#define LPWRRSTF_RESET_OCCURRED 0x01

/* WWDGRSTF: Window watchdog reset flag
Set by hardware when a window watchdog reset occurs.
Cleared by writing to the RMVF bit.
0: No window watchdog reset occurred
1: Window watchdog reset occurred */
#define WWDGRSTF_RESET_NO_OCCURRED 0x00
#define WWDGRSTF_RESET_OCCURRED 0x01

/* IWDGRSTF: Independent watchdog reset flag
Set by hardware when an independent watchdog reset from VDD domain occurs.
Cleared by writing to the RMVF bit.
0: No watchdog reset occurred
1: Watchdog reset occurred */
#define IWDGRSTF_RESET_NO_OCCURRED 0x00
#define IWDGRSTF_RESET_OCCURRED 0x01

/* SFTRSTF: Software reset flag
Set by hardware when a software reset occurs.
Cleared by writing to the RMVF bit.
0: No software reset occurred
1: Software reset occurred */
#define SFTRSTF_RESET_NO_OCCURRED 0x00
#define SFTRSTF_RESET_OCCURRED 0x01

/* PORRSTF: POR/PDR reset flag
Set by hardware when a POR/PDR reset occurs.
Cleared by writing to the RMVF bit.
0: No POR/PDR reset occurred
1: POR/PDR reset occurred */
#define PORRSTF_RESET_NO_OCCURRED 0x00
#define PORRSTF_RESET_OCCURRED 0x01

/* PINRSTF: PIN reset flag
Set by hardware when a reset from the NRST pin occurs.
Cleared by writing to the RMVF bit.
0: No reset from NRST pin occurred
1: Reset from NRST pin occurred */
#define PINRSTF_RESET_NO_OCCURRED 0x00
#define PINRSTF_RESET_OCCURRED 0x01

/* RMVF: Remove reset flag
Set by software to clear the reset flags.
0: No effect
1: Clear the reset flags */
#define RMVF_NO_EFFECT 0x00
#define RMVF_CLEAR_RESET 0x01

/* LSIRDY: Internal low-speed oscillator ready
Set and cleared by hardware to indicate when the internal RC 40 kHz oscillator is stable.
After the LSION bit is cleared, LSIRDY goes low after 3 internal RC 40 kHz oscillator clock
cycles.
0: Internal RC 40 kHz oscillator not ready
1: Internal RC 40 kHz oscillator ready */
#define LSIRDY_40KHZ_NOT_READY 0x00
#define LSIRDY_40KHZ_READY 0x01

/* LSION: Internal low-speed oscillator enable
Set and cleared by software.
0: Internal RC 40 kHz oscillator OFF
1: Internal RC 40 kHz oscillator ON */
#define LSION_40KHZ_OFF 0x00
#define LSION_40KHZ_ON 0x01

#define RCC_BASE_ADDRESS (RCC_REG_MAP *)0x40021000
static volatile RCC_REG_MAP *const stm32f1x_rcc_reg = RCC_BASE_ADDRESS;

void stm32f1x_rcc_driver_init()
{
    stm32f1x_rcc_reg->CR_REG.HSION = HSION_8Mhz_INTERNAL_ON;
    stm32f1x_rcc_reg->CR_REG.HSEON = HSEON_OSC_ON;
    while(stm32f1x_rcc_reg->CR_REG.HSERDY != HSERDY_HSE_READY); /* wait for HSE ready */

    stm32f1x_rcc_reg->CFGR_REG.PLLSRC = PLLSRC_HSE_CLOCK;
    stm32f1x_rcc_reg->CFGR_REG.PLLXTPRE = PLLXTPRE_NOT_DIV;
    stm32f1x_rcc_reg->CFGR_REG.PLLMUL = PLLMUL_MUL_9;
    stm32f1x_rcc_reg->CR_REG.PLLON = PLLON_ON; 
    while(stm32f1x_rcc_reg->CR_REG.PLLRDY != PLLRDY_LOCKED); /* wait for PLL ready */

    stm32f1x_flash_driver_changeLatency();
    stm32f1x_rcc_reg->CFGR_REG.HPRE = HPRE_SYSCLK_NOT_DIV;
    stm32f1x_rcc_reg->CFGR_REG.SW = SW_PLL_SELECTED;
    while(stm32f1x_rcc_reg->CFGR_REG.SWS != SWS_PLL_STS_SELECTED); /* wait for PLL switch completely */
    stm32f1x_rcc_reg->CFGR_REG.PPRE1 = PPRE1_HCLK_DIV_2;
    stm32f1x_rcc_reg->CFGR_REG.PPRE2 = PPRE2_HCLK_NOT_DIV;

    stm32f1x_rcc_reg->CIR_REG.LSIRDYC = LSIRDYC_CLEAR_FLAG;
    stm32f1x_rcc_reg->CIR_REG.HSIRDYC = HSIRDYC_CLEAR_FLAG;
    stm32f1x_rcc_reg->CIR_REG.HSERDYC = HSERDYC_CLEAR_FLAG;
    stm32f1x_rcc_reg->CIR_REG.PLLRDYC = PLLRDYC_CLEAR_FLAG;
    stm32f1x_rcc_reg->CIR_REG.CSSC = CSSC_CLEAR_FLAG;

    stm32f1x_rcc_reg->APB2ENR_REG.IOPCEN = IOPCEN_CLOCK_ENABLE;
    stm32f1x_rcc_reg->APB1ENR_REG.TIM6EN = TIM6EN_CLOCK_ENABLE;
}
